[
  {
    "title": "DevOps Engineer - Remote, United States",
    "company": "Zoom",
    "location": "Remote, United States",
    "summary": "Looking for a DevOps Engineer with production knowledge to support critical, high visibility applications. Requires experience with scripting (Bash, Python), configuration/deployment (Terraform, Ansible, Jenkins), and containerization (Kubernetes, AWS EKS, Docker). Focus on designing zero-downtime solutions and developing CI/CD pipelines.",
    "link": "zoom.us"
  },
  {
    "title": "DevOps Engineer (Remote)",
    "company": "MOSTLY AI",
    "location": "Remote (EMEA region)",
    "summary": "Experienced DevOps Engineer for deep tech products written in Python. Focus on automation, managing cloud/on-prem deployments, CI/CD (GitHub Actions, ArgoCD/FluxCD), IaC (Helm, Terraform), and Kubernetes. Python familiarity is an advantage.",
    "link": "dynamitejobs.com"
  },
  {
    "title": "Remote Python Developer (with Systems Engineering/DevOps focus)",
    "company": "OnTheGoSystems",
    "location": "Remote (Global)",
    "summary": "Seeking a developer with strong Python to build core AI systems. Involves Systems engineering, Async pipelines, background job processing, SQL/PostgreSQL, Docker + GitLab CI, and clean integrations.",
    "link": "weworkremotely.com"
  },
  {
    "title": "Senior Python Developer/DevOps Engineer",
    "company": "Six Feet Up",
    "location": "United States (Remote)",
    "summary": "Combined role focusing on both Python development and DevOps engineering tasks.",
    "link": "remotepython.com"
  },
  {
    "title": "Python DevOps Engineer",
    "company": "Mercor",
    "location": "Remote (India, Latin America, or U.S. College Student)",
    "summary": "Focus on pip/conda environment setup/management, dependency management in Python for an AI research lab project. Requires 2+ years experience, Docker, and CI/CD experience.",
    "link": "mercor.com"
  },
  {
    "title": "Remote Python + AWS DevOps Engineer",
    "company": "nSoft",
    "location": "Remote (Europe: Armenia, Belarus, Croatia, Hungary, Lithuania, Poland, Serbia)",
    "summary": "Hands-on DevOps Engineer focusing on AWS cloud architecture, IaC (Terraform), RDS/Postgres management. Primary responsibilities include building, monitoring, and maintaining CD pipelines and writing scripts primarily using Python. Comfortable with Kubernetes and Ansible.",
    "link": "remoteok.com"
  },
  {
    "title": "DevOps Engineer - Fully Remote",
    "company": "VERTECH GROUP (UK) LTD",
    "location": "Remote (UK)",
    "summary": "Complete remote role with quarterly meet-ups. Requires working knowledge of scripting languages like Python, Bash, and experience with Terraform, AWS or Azure.",
    "link": "totaljobs.com"
  },
  {
    "title": "Azure DevOps Engineer",
    "company": "Evnek",
    "location": "United States – Remote",
    "summary": "Deploying and optimizing data workflows in a cloud ecosystem. Working with cross-functional teams to ensure scalable and efficient data pipeline operations. Skills include Azure, ETL, PySpark, SQL.",
    "link": "remoterocketship.com"
  },
  {
    "title": "Staff Site Reliability Engineer, SRE – Platform Reliability",
    "company": "Affirm",
    "location": "Spain – Remote",
    "summary": "Focus on operational excellence and system reliability. Requires AWS, Distributed Systems, Kotlin, Kubernetes, MySQL, Python, and Spark.",
    "link": "remoterocketship.com"
  },
  {
    "title": "Staff Site Reliability Engineer, SRE – Platform Reliability",
    "company": "Affirm",
    "location": "Poland – Remote",
    "summary": "Focus on operational excellence and strategic project implementation. Collaborating with multiple teams to enhance system reliability and performance. Requires AWS, Distributed Systems, Kotlin, Kubernetes, MySQL, Python, and Spark.",
    "link": "remoterocketship.com"
  },
  {
    "title": "Senior DevOps Engineer",
    "company": "MOCA Systems, Inc.",
    "location": "Remote (US)",
    "summary": "Responsible for infrastructure management and automation. Utilizing Ansible, Terraform, Python, and Jenkins for software deployment and monitoring.",
    "link": "remoterocketship.com"
  },
  {
    "title": "Storage DevOps Engineer",
    "company": "MetroSys, Inc.",
    "location": "Remote (US)",
    "summary": "Responsible for Python scripting and automation in cloud environments. Collaborates with teams to streamline deployments and optimize storage operations.",
    "link": "remoterocketship.com"
  },
  {
    "title": "Senior DevOps Engineer (AWS - Python/Bash)",
    "company": "Revvity",
    "location": "Remote (CAD Remote – ON)",
    "summary": "Lead the transformation to DevOps and Continuous Delivery. Support development/production environments, implement monitoring, and design/support internal development environments in AWS. Requires 3-5 years experience with AWS, Linux, and scripting (Bash or Python).",
    "link": "revvity.com"
  },
  {
    "title": "Senior DevOps Engineer",
    "company": "Trilogy (via Crossover)",
    "location": "Remote (Global)",
    "summary": "AWS infrastructure expert to migrate legacy infrastructure to a streamlined, scalable AWS ecosystem. Requires strong Python or JavaScript skills for automation/tooling, advanced Docker/Kubernetes, and IaC (Terraform, Ansible, or CloudFormation).",
    "link": "crossover.com"
  },
  {
    "title": "Senior DevOps Engineer (AWS)",
    "company": "Proxify",
    "location": "Remote (CET +/- 3 HOURS)",
    "summary": "Specializing in AWS. Develop and maintain CI/CD pipelines, automate infrastructure (Terraform, Ansible), monitor and optimize cloud resources. Requires 5+ years experience, and proficiency in scripting languages such as Python.",
    "link": "remotive.com"
  },
  {
    "title": "Senior DevOps Engineer - Remote",
    "company": "Synopsys",
    "location": "Remote",
    "summary": "Member of the SRE team working with development teams to create automated pipelines and solutions for continuous delivery. Requires proficiency in scripting (Python preferred), 3+ years with Git/GitHub, AWS, and Terraform. Focus on EKS, Linux, and automated build systems.",
    "link": "synopsys.com"
  },
  {
    "title": "Senior Cloud Engineer (DevOps focus)",
    "company": "Link Group",
    "location": "Remote (Warszawa, Poland)",
    "summary": "Design, build, and automate cloud infrastructure (AWS / Azure) using Terraform, Python, and Bash. Deploy, manage, and optimize Kubernetes clusters. Requires 5+ years experience with cloud, Kubernetes, Docker, and IaC.",
    "link": "nofluffjobs.com"
  },
  {
    "title": "Cloud DevOps Engineer",
    "company": "Madiff",
    "location": "Poland – Remote",
    "summary": "Supporting high-performance infrastructure for GenAI applications. Focus on cloud automation, CI/CD ownership, and infrastructure-as-code in modern Azure environments. Requires Python, Ansible, AWS, Azure, Docker, Jenkins, Kubernetes, etc.",
    "link": "remoterocketship.com"
  },
  {
    "title": "DevOps Engineer",
    "company": "Cloud Hero",
    "location": "Remote (Global)",
    "summary": "Building and managing cloud infrastructure while implementing automation and best practices. Collaborating with teams to enhance tools and ensure reliable systems in a friendly environment.",
    "link": "remoterocketship.com"
  },
  {
    "title": "DevOps Cloud Engineer",
    "company": "Advancio, Inc",
    "location": "Remote (Global)",
    "summary": "Responsible for design, implementation, and management of scalable cloud-based infrastructure. Enhancing DevOps processes and application delivery.",
    "link": "remoterocketship.com"
  }
]